Мюнцкабинент_30/src/Documents/Планирование/Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Планирование</name>
  <comment>План приобретения объектов в коллекцию</comment>
  <registerRecords>InformationRegister.Планирование</registerRecords>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>ВидМонеты</name>
      <type>
        <types>CatalogRef.ВидыМонет</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/InformationRegisters/Планирование/Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Планирование</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМонеты</name>
    <type>
      <types>CatalogRef.ВидыМонет</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/Documents/Планирование/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Коллекционер) Тогда
		Коллекционер = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	СуммаДокумента = Список.Итог("Цена");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Планирование
	Движения.Планирование.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение 				= Движения.Планирование.Добавить();
		Движение.Коллекционер 	= Коллекционер;
		Движение.Коллекция 		= Коллекция;
		Движение.ВидМонеты 		= ТекСтрокаСписок.ВидМонеты;
		Движение.Количество 	= 1;
		Движение.Сумма 			= ТекСтрокаСписок.Цена;
	КонецЦикла;

КонецПроцедуры
